app/controllers/photos_controller.rb

INSERT INTO "photos" ("caption", "created_at", "image", "incident_name", "operational_period", "tags", "team_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if params[:photo] and params[:photo][:image]
      @photo = make_photo
      if @photo.save

UPDATE "photos" SET "incident_name" = ?, "updated_at" = ? WHERE "photos"."id" = 1  [["incident_name", "Craig"], ["updated_at", Fri, 15 Nov 2013 22:34:31 UTC +00:00]]
---
  def update
    redirect_to photo_path(@photo), alert: "Couldn't update the photo." and return unless @photo.update_attributes(photo_params)

DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo.destroy

INSERT INTO "photos" ("created_at", "edited", "image", "incident_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 15 Nov 2013 22:38:54 UTC +00:00], ["edited", false], ["image", "Water.jpg"], ["incident_name", "no incident name"], ["updated_at", Fri, 15 Nov 2013 22:38:54 UTC +00:00]]
---
  def make_multiple
    redirect_to photos_multiple_uploads_path, alert: "No files chosen!" and return unless params[:photos] and params[:photos][:images]
    params[:photo] = params[:photos]
    params[:photos][:images].each do |photo|
      params[:photo][:image] = photo
      redirect_to photos_multiple_uploads_path, alert: "Couldn't save photo!" and return unless make_photo.save